; ModuleID = 'linked.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Bumper = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }

@llvm.compiler.used = appending global [2 x i8*] [i8* bitcast (i8* (i8*, i8*)* @vuln_rx_brake_routine to i8*), i8* bitcast (i8* (i8*, i8*)* @patched_rx_brake_routine to i8*)], section "llvm.metadata"
@vuln___anvill_stack_minus_4 = global i8 0
@vuln___anvill_stack_minus_3 = global i8 0
@vuln___anvill_stack_minus_2 = global i8 0
@vuln___anvill_stack_minus_1 = global i8 0
@vuln___anvill_stack_0 = global i8 0
@vuln___anvill_stack_plus_1 = global i8 0
@vuln___anvill_stack_plus_2 = global i8 0
@vuln___anvill_stack_plus_3 = global i8 0
@vuln___anvill_stack_plus_4 = global i8 0
@vuln___anvill_stack_plus_5 = global i8 0
@vuln___anvill_stack_plus_6 = global i8 0
@vuln___anvill_stack_plus_7 = global i8 0
@vuln___anvill_stack_plus_8 = global i8 0
@vuln___anvill_stack_plus_9 = global i8 0
@vuln___anvill_stack_plus_10 = global i8 0
@vuln___anvill_stack_plus_11 = global i8 0
@vuln_buf = common dso_local global [8 x i8] zeroinitializer, align 1, !dbg !0
@vuln_bumper = common dso_local global %struct.Bumper zeroinitializer, align 4, !dbg !6
@patched___anvill_stack_minus_4 = global i8 0
@patched___anvill_stack_minus_3 = global i8 0
@patched___anvill_stack_minus_2 = global i8 0
@patched___anvill_stack_minus_1 = global i8 0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 5, type: !34, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "glue.c", directory: "/home/mini/workspace/ironpatch/ironSymCmp/vuln")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "bumper", scope: !2, file: !3, line: 6, type: !8, isLocal: false, isDefinition: true)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bumper", file: !9, line: 9, size: 160, elements: !10)
!9 = !DIFile(filename: "./../bumper.h", directory: "/home/mini/workspace/ironpatch/ironSymCmp/vuln")
!10 = !{!11, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !33}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "outer_left", scope: !8, file: !9, line: 11, baseType: !12, size: 8)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !14)
!13 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 38, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inner_left", scope: !8, file: !9, line: 12, baseType: !12, size: 8, offset: 8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inner_right", scope: !8, file: !9, line: 13, baseType: !12, size: 8, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outer_right", scope: !8, file: !9, line: 14, baseType: !12, size: 8, offset: 24)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "has_flashed", scope: !8, file: !9, line: 16, baseType: !12, size: 8, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "brake_state", scope: !8, file: !9, line: 17, baseType: !12, size: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flash_lock", scope: !8, file: !9, line: 18, baseType: !12, size: 8, offset: 48)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "num_flashes", scope: !8, file: !9, line: 19, baseType: !12, size: 8, offset: 56)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "need_to_signal", scope: !8, file: !9, line: 21, baseType: !12, size: 8, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "left_lock", scope: !8, file: !9, line: 22, baseType: !12, size: 8, offset: 72)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "right_lock", scope: !8, file: !9, line: 22, baseType: !12, size: 8, offset: 80)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !8, file: !9, line: 23, baseType: !12, size: 8, offset: 88)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flash_timer", scope: !8, file: !9, line: 25, baseType: !29, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !30, line: 7, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types/clock_t.h", directory: "")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !15, line: 156, baseType: !32)
!32 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "signal_timer", scope: !8, file: !9, line: 26, baseType: !29, size: 32, offset: 128)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 8)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "buf", scope: !39, file: !40, line: 5, type: !34, isLocal: false, isDefinition: true)
!39 = distinct !DICompileUnit(language: DW_LANG_C99, file: !40, producer: "clang version 10.0.1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !41, splitDebugInlining: false, nameTableKind: None)
!40 = !DIFile(filename: "glue.c", directory: "/home/mini/workspace/ironpatch/ironSymCmp/patched")
!41 = !{!37, !42}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "bumper", scope: !39, file: !40, line: 6, type: !44, isLocal: false, isDefinition: true)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bumper", file: !45, line: 9, size: 160, elements: !46)
!45 = !DIFile(filename: "./../bumper.h", directory: "/home/mini/workspace/ironpatch/ironSymCmp/patched")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "outer_left", scope: !44, file: !45, line: 11, baseType: !12, size: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "inner_left", scope: !44, file: !45, line: 12, baseType: !12, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "inner_right", scope: !44, file: !45, line: 13, baseType: !12, size: 8, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "outer_right", scope: !44, file: !45, line: 14, baseType: !12, size: 8, offset: 24)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "has_flashed", scope: !44, file: !45, line: 16, baseType: !12, size: 8, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "brake_state", scope: !44, file: !45, line: 17, baseType: !12, size: 8, offset: 40)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flash_lock", scope: !44, file: !45, line: 18, baseType: !12, size: 8, offset: 48)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "num_flashes", scope: !44, file: !45, line: 19, baseType: !12, size: 8, offset: 56)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "need_to_signal", scope: !44, file: !45, line: 21, baseType: !12, size: 8, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "left_lock", scope: !44, file: !45, line: 22, baseType: !12, size: 8, offset: 72)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "right_lock", scope: !44, file: !45, line: 22, baseType: !12, size: 8, offset: 80)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !44, file: !45, line: 23, baseType: !12, size: 8, offset: 88)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flash_timer", scope: !44, file: !45, line: 25, baseType: !29, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "signal_timer", scope: !44, file: !45, line: 26, baseType: !29, size: 32, offset: 128)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 10.0.1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "superglue.c", directory: "/home/mini/workspace/ironpatch/ironSymCmp")
!63 = distinct !DICompileUnit(language: DW_LANG_C89, file: !64, producer: "clang version 10.0.1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!64 = !DIFile(filename: "/home/mini/.cache/yay/klee/src/klee/runtime/FreeStanding/memcmp.c", directory: "/home/mini/.cache/yay/klee/src/build/runtime/FreeStanding")
!65 = distinct !DICompileUnit(language: DW_LANG_C89, file: !66, producer: "clang version 10.0.1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!66 = !DIFile(filename: "/home/mini/.cache/yay/klee/src/klee/runtime/FreeStanding/memcpy.c", directory: "/home/mini/.cache/yay/klee/src/build/runtime/FreeStanding")
!67 = !{!"clang version 10.0.1 "}
!68 = !{i32 1, !"NumRegisterParameters", i32 0}
!69 = !{i32 7, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{i32 1, !"wchar_size", i32 4}
!72 = !{i32 7, !"PIC Level", i32 2}
!73 = !{i32 7, !"PIE Level", i32 2}
!74 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 8, type: !75, scopeLine: 8, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!75 = !DISubroutineType(types: !76)
!76 = !{!77}
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DILocation(line: 9, column: 3, scope: !74)
!79 = !DILocation(line: 10, column: 3, scope: !74)
!80 = distinct !DISubprogram(name: "main", scope: !40, file: !40, line: 8, type: !75, scopeLine: 8, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !4)
!81 = !DILocation(line: 9, column: 3, scope: !80)
!82 = !DILocation(line: 10, column: 3, scope: !80)
!83 = distinct !DISubprogram(name: "main", scope: !62, file: !62, line: 17, type: !75, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !4)
!84 = !DILocalVariable(name: "buf", scope: !83, file: !62, line: 19, type: !34)
!85 = !DILocation(line: 19, column: 16, scope: !83)
!86 = !DILocation(line: 20, column: 21, scope: !83)
!87 = !DILocation(line: 20, column: 2, scope: !83)
!88 = !DILocalVariable(name: "bumper", scope: !83, file: !62, line: 22, type: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bumper", file: !90, line: 9, size: 160, elements: !91)
!90 = !DIFile(filename: "./bumper.h", directory: "/home/mini/workspace/ironpatch/ironSymCmp")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "outer_left", scope: !89, file: !90, line: 11, baseType: !12, size: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "inner_left", scope: !89, file: !90, line: 12, baseType: !12, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "inner_right", scope: !89, file: !90, line: 13, baseType: !12, size: 8, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "outer_right", scope: !89, file: !90, line: 14, baseType: !12, size: 8, offset: 24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "has_flashed", scope: !89, file: !90, line: 16, baseType: !12, size: 8, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "brake_state", scope: !89, file: !90, line: 17, baseType: !12, size: 8, offset: 40)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flash_lock", scope: !89, file: !90, line: 18, baseType: !12, size: 8, offset: 48)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "num_flashes", scope: !89, file: !90, line: 19, baseType: !12, size: 8, offset: 56)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "need_to_signal", scope: !89, file: !90, line: 21, baseType: !12, size: 8, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_lock", scope: !89, file: !90, line: 22, baseType: !12, size: 8, offset: 72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_lock", scope: !89, file: !90, line: 22, baseType: !12, size: 8, offset: 80)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !89, file: !90, line: 23, baseType: !12, size: 8, offset: 88)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flash_timer", scope: !89, file: !90, line: 25, baseType: !29, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "signal_timer", scope: !89, file: !90, line: 26, baseType: !29, size: 32, offset: 128)
!106 = !DILocation(line: 22, column: 16, scope: !83)
!107 = !DILocation(line: 23, column: 21, scope: !83)
!108 = !DILocation(line: 23, column: 2, scope: !83)
!109 = !DILocation(line: 25, column: 2, scope: !83)
!110 = !DILocation(line: 26, column: 2, scope: !83)
!111 = !DILocation(line: 28, column: 2, scope: !83)
!112 = !DILocation(line: 29, column: 2, scope: !83)
!113 = !DILocation(line: 31, column: 2, scope: !83)
!114 = !DILocation(line: 32, column: 2, scope: !83)
!115 = !DILocation(line: 35, column: 2, scope: !83)
!116 = !DILocation(line: 36, column: 1, scope: !83)
!117 = distinct !DISubprogram(name: "memcmp", scope: !118, file: !118, line: 42, type: !119, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!118 = !DIFile(filename: "klee/runtime/FreeStanding/memcmp.c", directory: "/home/mini/.cache/yay/klee/src")
!119 = !DISubroutineType(types: !120)
!120 = !{!77, !121, !121, !123}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !124, line: 46, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/clang/10.0.1/include/stddef.h", directory: "")
!125 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!126 = !DILocalVariable(name: "s1", arg: 1, scope: !117, file: !118, line: 42, type: !121)
!127 = !DILocation(line: 42, column: 24, scope: !117)
!128 = !DILocalVariable(name: "s2", arg: 2, scope: !117, file: !118, line: 42, type: !121)
!129 = !DILocation(line: 42, column: 40, scope: !117)
!130 = !DILocalVariable(name: "n", arg: 3, scope: !117, file: !118, line: 42, type: !123)
!131 = !DILocation(line: 42, column: 51, scope: !117)
!132 = !DILocation(line: 43, column: 7, scope: !133)
!133 = distinct !DILexicalBlock(scope: !117, file: !118, line: 43, column: 7)
!134 = !DILocation(line: 43, column: 9, scope: !133)
!135 = !DILocation(line: 43, column: 7, scope: !117)
!136 = !DILocalVariable(name: "p1", scope: !137, file: !118, line: 44, type: !138)
!137 = distinct !DILexicalBlock(scope: !133, file: !118, line: 43, column: 15)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!140 = !DILocation(line: 44, column: 26, scope: !137)
!141 = !DILocation(line: 44, column: 31, scope: !137)
!142 = !DILocalVariable(name: "p2", scope: !137, file: !118, line: 44, type: !138)
!143 = !DILocation(line: 44, column: 36, scope: !137)
!144 = !DILocation(line: 44, column: 41, scope: !137)
!145 = !DILocation(line: 46, column: 5, scope: !137)
!146 = !DILocation(line: 47, column: 14, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !118, line: 47, column: 11)
!148 = distinct !DILexicalBlock(scope: !137, file: !118, line: 46, column: 8)
!149 = !DILocation(line: 47, column: 11, scope: !147)
!150 = !DILocation(line: 47, column: 23, scope: !147)
!151 = !DILocation(line: 47, column: 20, scope: !147)
!152 = !DILocation(line: 47, column: 17, scope: !147)
!153 = !DILocation(line: 47, column: 11, scope: !148)
!154 = !DILocation(line: 48, column: 18, scope: !155)
!155 = distinct !DILexicalBlock(scope: !147, file: !118, line: 47, column: 27)
!156 = !DILocation(line: 48, column: 17, scope: !155)
!157 = !DILocation(line: 48, column: 26, scope: !155)
!158 = !DILocation(line: 48, column: 25, scope: !155)
!159 = !DILocation(line: 48, column: 23, scope: !155)
!160 = !DILocation(line: 48, column: 9, scope: !155)
!161 = !DILocation(line: 50, column: 14, scope: !137)
!162 = !DILocation(line: 50, column: 18, scope: !137)
!163 = !DILocation(line: 50, column: 5, scope: !148)
!164 = distinct !{!164, !145, !165}
!165 = !DILocation(line: 50, column: 22, scope: !137)
!166 = !DILocation(line: 52, column: 3, scope: !117)
